src/Documents/СчетНаОплату/СчетНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаОплату</name>
  <registerRecords>AccumulationRegister.РезервыТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <basedOn>Document.СчетНаОплату</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccountingRegister.РегистрБухгалтерии</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СчетНаОплату/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные.Номенклатура;
	Элементы.Товары.ТекущиеДанные.Цена = ПолучитьЦену(Товар);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар)
	//Возврат Товар.ЦенаПродажи;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|	ЦенаПродажи
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	Ссылка = &АБВ";
	
	Запрос.УстановитьПараметр("АБВ", Товар); 
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ЦенаПродажи;
	
КонецФункции

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьСумму(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСумму(Стр)
	Стр.Сумма = Стр.Цена * Стр.Количество;
КонецПроцедуры


&НаСервере
Процедура ДатьСкидкуНаСервере()
	Для каждого Стр Из Объект.Товары Цикл
		Стр.Цена = Стр.Цена * 0.9;
		РассчитатьСумму(Стр);
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура ДатьСкидку(Команда)
	ДатьСкидкуНаСервере();
КонецПроцедуры


&НаСервере
Функция Печать1НаСервере()
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.СчетНаОплату.ПолучитьМакет("Макет");
	ОблШапка = Макет.ПолучитьОбласть("ОблШапка");
	ОблСтрока = Макет.ПолучитьОбласть("ОблСтрока");
	ОблПодвал = Макет.ПолучитьОбласть("ОблПодвал");

	ОблШапка.Параметры.Номер = Объект.Номер;
	ОблШапка.Параметры.Дата = Формат(Объект.Дата, "Л=sq_AL; ДЛФ=DD"); 
	ОблШапка.Параметры.Контрагент = Объект.Контрагент;
	ОблШапка.Параметры.Договор = Объект.Договор;
	
	ТабДок.Вывести(ОблШапка);	
	
	Для каждого Стр Из Объект.Товары Цикл
		ОблСтрока.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла; 
	
	СуммаИтого = Объект.Товары.Итог("Сумма");
	ОблПодвал.Параметры.СуммаПрописью = ЧислоПрописью(СуммаИтого,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	
	ТабДок.ОтображатьГруппировки = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	ТабДок.Вывести(ОблПодвал);
	
	Возврат ТабДок;
КонецФункции


&НаКлиенте
Процедура Печать1(Команда)
	ТабДок = Печать1НаСервере();
	ТабДок.Показать();
КонецПроцедуры


&НаКлиенте
Процедура ВводНаОснованииВручную(Команда)
	
	Парам = Новый Структура;
	Парам.Вставить("Основание", Объект.Ссылка);
	Парам.Вставить("Скидка", 10);
	
	ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", Парам);
	
КонецПроцедуры
